#Практическая задание
my_string = input("Рада Вас Приветствовать! Напишите Ваше Имя и Отчество: ")
#my_string = "Рада Вас Приветствовать! Как Вас зовут: "
print(my_string.upper())
print(my_string.lower())
print(my_string.replace(" ", "#"))
print(my_string[0])
print(my_string[-1])






#Лекция. Организация программ и методы строк
#name = input("Пожалуйста, Введите ваше имя: ")
#print(type (name))
#print("Здраствуйте,", name)
#current_year = 2024
#date_of_birth = int (input("В каком году Вы родились? "))
#age = current_year - date_of_birth
#print("В этом году Вам", age, "лет")

#print('привет, я строка в нижнем регистре'.upper())# Переводит в вверхний регистр
#print('ПРИВЕТ, Я СТРОКА В НИЖНЕМ РЕГИСТРЕ'.lower())# Переводит в нижний регистр
#print('привет, я строка в нижнем регистре'.replace('нижнем', 'ВЕРХНЕМ'))# Слова old и new ставятся автоматически
#print('привет, я строка в нижнем регистре'.replace(' ', '#'))# Уберает пробелы



